---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.CentroidVertical
source: html/35c60a0a-7a48-461a-396f-3e55edef2c87.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.CentroidVertical Property

Distance from centroid to the upper extremites along vertical axis.

## Syntax (C#)
```csharp
public double CentroidVertical { get; set; }
```